read_verilog dff_asyncres.v

synth -top dff_asyncres
dfflibmap -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib

abc -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
clean
show

stat -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib

write_verilog -noattr asyres_netlist.v
