read_verilog dff_async_set.v

synth -top dff_async_set
dfflibmap -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib

abc -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
clean
show

stat -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib

write_verilog -noattr asyset_netlist.v
