read_liberty -lib ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog mult_8.v

synth -top mult8

abc -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib

show

stat -liberty ../lib/sky130_fd_sc_hd__tt_025C_1v80.lib

write_verilog -noattr mult8_netlist.v
